public class Main {
    public static void main(String[] args) {
        task7();
    }

//    ### Задание 1
//
//    Представим, что мы работаем в банке. У нашего банка есть сайт, на который можно зайти с компьютера или телефона, а также мобильное приложение.
//    И нам, и клиенту удобнее с телефона пользоваться мобильным приложением.
//    Поэтому каждый раз, когда пользователь заходит на сайт с телефона, мы должны выдавать ему ссылку на скачивание приложения. Но мы не знаем, iOS или Android он использует.
//    Напишите программу, которая определяет, чем пользуется клиент (iOS или Android), и выдает соответствующее сообщение для обоих вариантов.
//    Объявите переменную clientOS, которая равна 0 или 1. Где 0 — iOS, 1 — Android.
//    При отработке программы в консоли должно выдаваться сообщение об установке соответствующего приложения.
//    Например, для iOS оно будет звучать так: «Установите версию приложения для iOS по ссылке».
//    А для Android так: «Установите версию приложения для Android по ссылке».
    private static void task1() {
        int clientOS = 0;
        if (clientOS == 0) {
            System.out.println("Установите версию приложения для iOS по ссылке");
        } else {
            System.out.println("Установите версию приложения для Android по ссылке");
        }
    }

//    ### Задание 2
//
//    К нам пришли коллеги и сообщили, что нам нужно знать не только операционную систему телефона, но и год его создания: от этого зависит, подойдет ли приложение для телефона или оно просто не установится.
//    Если телефон произведен с 2015 по нынешний год, то приложение будет работать корректно.
//    Если телефон произведен ранее 2015 года, то клиенту нужно посоветовать установить облегченную версию приложения.
//    Ваша задача: написать программу, которая выдает соответствующее сообщение клиенту при наличии двух условий — операционной системы телефона (iOS или Android) и года производства.
//    Если год выпуска ранее 2015 года, то к сообщению об установке нужно добавить информацию об облегченной версии.
//    Например, для iOS оно будет звучать так: «Установите облегченную версию приложения для iOS по ссылке».
//    А для Android так: «Установите облегченную версию приложения для Android по ссылке».
//    При этом для пользователей с телефоном с 2015 года выпуска нужно вывести обычное предложение об установке приложения.
//    Для обозначения года создания используйте переменную clientDeviceYear, где необходимо указать любой желаемый год.
//            **Важно**: вложенность больше двух этажей не допускается (условный оператор внутри условного оператора).
    private static void task2() {
        int clientOS = 0;
        int clientDeviceYear = 2020;
        if (clientOS == 0) {
            if (clientDeviceYear < 2015) {
                System.out.println("Установите облегченную версию приложения для iOS по ссылке");
            } else {
                System.out.println("Установите версию приложения для iOS по ссылке");
            }
        } else {
            if (clientDeviceYear < 2015) {
                System.out.println("Установите облегченную версию приложения для Android по ссылке");
            } else {
                System.out.println("Установите версию приложения для Android по ссылке");
            }
        }
    }

//    ### Задание 3
//
//    Напишите программу, которая определяет, является ли год високосным или нет.
//    Переменную года назовите year, в которую можно подставить значение интересующего нас года. Например, 2021.
//    Программа должна определять, високосный год или нет, и выводить соответствующее сообщение:
//    « …. год является високосным». или «... год не является високосным».
//    Небольшая справка: високосным является каждый четвертый год, но не является каждый сотый. Также високосным является каждый четырехсотый год.
    private static void task3() {
        int year = 2021;
        if (year % 4 == 0 && year % 100 != 0 || year % 400 == 0) {
            System.out.println(year + " год является високосным");
        } else {
            System.out.println(year + " год не является високосным");
        }
    }

//    ### Задание 4
//    Вернемся к делам банковским. У нас хороший банк, поэтому для наших клиентов мы организуем доставку банковских карт на дом с четкой датой доставки.
//    Чтобы известить клиента о том, когда будет доставлена его карта, нам нужно знать расстояние от нашего офиса до адреса доставки.
//    Правила доставки такие:
//    Доставка в пределах 20 км занимает сутки.
//    Доставка в пределах от 20 км до 60 км добавляет еще один день доставки.
//    Доставка в пределах 60 км до 100 км добавляет еще одни сутки.
//    То есть с каждым следующим интервалом доставки срок увеличивается на 1 день.
//    Напишите программу, которая выдает сообщение в консоль:
//    "Потребуется дней: " + срок доставки
//    Объявите целочисленную переменную deliveryDistance = 95, которая содержит дистанцию до клиента.
    private static void task4() {
        int deliveryDistance = 94;
        int deliveryDays = 1;
        if (deliveryDistance > 20) {
            deliveryDays++;
        }
        if (deliveryDistance > 60) {
            deliveryDays++;
        }
        System.out.println(deliveryDays);
    }

//    Напишите программу, которая определяет по номеру месяца в году, к какому сезону этот месяц принадлежит. Например, 1 месяц (он же январь) принадлежит к сезону зима.
//    Для написания программы используйте оператор switch. Для обозначения номера месяца используйте переменную monthNumber = 12.
//    Пропишите условие, при котором программа не будет выполняться (номер месяца больше 13).
    private static void task5() {
        int monthNumber = 12;
        switch (monthNumber) {
            case 12:
            case 1:
            case 2:
                System.out.println("Зима");
                break;
            case 3:
            case 4:
            case 5:
                System.out.println("Весна");
                break;
            case 6:
            case 7:
            case 8:
                System.out.println("Лето");
                break;
            case 9:
            case 10:
            case 11:
                System.out.println("Осень");
                break;
            default:
                System.out.println("Тагоко номера месяца не сущетсвует");
        }
    }

    public static void task6() {
        int age = 19;
        int salary = 58_000;
        double limit;
        if (age >= 23) {
            limit = salary * 3;
        } else {
            limit = salary * 2;
        }
        if (salary >= 50_000 && salary < 80_000) {
            limit = limit * 1.2;
        } else if (salary >= 80_000) {
            limit = limit * 1.5;
        }
        System.out.println("Мы готовы выдать вам кредитную карту с лимитом " + limit + " рублей");
    }

    public static void task7() {
        int age = 19;
        int salary = 60_000;
        int wantedSum = 330_000;
        double rate;
        if (salary > 80_000) {
            rate = 10 - 0.7;
        } else {
            rate = 10;
        }
        if (age < 23) {
            rate = rate + 1;
        } else if (age >= 23 && age < 30) {
            rate = rate + 0.5;
        }
        double maxPay = (double) salary / 2;
        double maxPayMonth = (wantedSum + (wantedSum * (rate / 100))) / 12;
        if (maxPay > maxPayMonth) {
            System.out.println("Максимальный платеж при ЗП " + salary + " равен " + maxPay + " рублей. Платеж по кредиту " + maxPayMonth + " рублей. Одобрено");
        } else {
            System.out.println("Максимальный платеж при ЗП " + salary + " равен " + maxPay + " рублей. Платеж по кредиту " + maxPayMonth + " рублей. Отказано");
        }
    }
}